Computational-model/TaylorCouette-LES/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   staticFvMesh;

// For convertToCylindrical
solidBodyMotionFvMeshCoeffs
{
	cellZone	rotating;
	solidBodyMotionFunction	rotatingMotion;
	rotatingMotionCoeffs
	{
	    origin	(0 0 0);
	    axis	(0 0 1);
	    omega	5.52; // rad/s
	}
}

// ************************************************************************* //
