Computational-model/TaylorCouette-LES/system/residuals.cfg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

type            residuals;
libs            ("libutilityFunctionObjects.so");

writeControl    timeStep;
writeInterval   1;

// ************************************************************************* //
