Computational-model/TaylorCouette-LES/system/surfaceRegion.cfg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

type            surfaceRegion;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
//writeInterval   1;

writeFields     false;
log             false;

// ************************************************************************* //
